---
kind: method
id: M:Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/7554be3f-70a4-90af-30b5-a53e854ec24a.htm
---
# Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.